# text which will be printed in _bot: 139
help_text = {'train': 'ЗАПОМНИТЕ перед тем как принять бой ПОСМОТРИТЕ на сложность моба\n\n'
                      '<i>Чтобы выйти из этого меню и начать игру нажмите \"В игру\" или напишите боту любое сообщение</i>',

             'desc': '<b>“Tower of God”</b> - это бот в телеграме, который поможет вам скоротать время в школе / метро / сортире🚬 \n'
                     'Состояние: ЗБТ(Закрытое бета тестирование), для записи на тест обращаться к @likeeven ',
             'other': '📌 Ссыль на бота: @TowerRPG_bot\n📌 Разработчик: @likeeven\n📌Новостной канал: @Tower_main\n📌Общение: @Tower_chat'}

greetings = ['Что ты желаешь?', 'Богатство?', 'Славу?', 'Власть?', 'Отмщение?', 'Или что-то гораздо большее?',
             'Все, что ты желаешь,', 'Находится <b>здесь</b>.']

# all of bot functions and it's description
func_description = {"👤 Профиль": '👤 Отображает ваш статус, экипировку и другие характеристики',
                    "⚔️ Бой": '⚔️ Бой - подбирает врага, характеристики и уровень сложности которого соответствуют уровню вашего персонажа. '
                              'Сложность противника зависит от всех характеристик персонажа.',
                    "💉 Исцеление": '💉 За небольшую цену востанавливает ваше здоровье',
                    "📯 Повышение ранга": '📯 Тест для повышения ранга. Чем выше ранг, тем выше вы в рейтинге и тем сильнее ваши враги! Не рекомендуется проходить без подготовки!',
                    "💼 Инвентарь": '💼 Инвентарь - отображает список предметов в инвентаре, также даёт возможность посмотреть характеристики этих предметов',
                    "📥 Надеть экипировку": '📥 Надеть экипировку - даёт возможность надеть экипировку которая есть у вас в инвентаре. Надеть экипировку можно нажав на кнопку "Надеть экипировку" и ввести название предмета с учётом регистра(A-a). ',
                    "📤 Снять экипировку": '📤 Снять экипировку - выводит меню с информацией о том, какая экипировка на данный момент надета. '
                                           'Как понятно из названия кнопки - с помощью этого меню можно снимать экипировку',
                    "🥋 Экипировка": '🥋 В этом меню вы можете управлять экипировкой',
                    "⚖️ Повышение характеристик": '⚖️ С повышением уровня вы получаете очки повышений, за них вы можете напрямую повышать ваши характеристики',
                    "⚒ Крафт": '⚒ Крафт - улучшения предметов путём их слияния, т.е. если у вас есть два одинаковых предмета - '
                               'вы можете скрафтить из них такой же рангом выше. Улучшенную экипировку нельзя будет раскрафтить обратно',
                    "🔈 Помощь": '🔈 Вы здесь',
                    "🛒 Магазин": '🛒 IN DEVELOPMENT'}


what_is_healing = ('❓ <b>Вы уверены что хотите войти в лазарет?</b>\n\n❔ Что такое лазарет?\n <i> -  Лазарет - это место где ваш персонаж "отдыхает" и восстанавливается после тяжёлых скитаний. '
                   'Каждые 5 минут пребывания в лазарете регенерируют +1 здоровье/защиту.</i>\n\n❔ Какие ограничения?\n <i> -  Большая часть игрового функционала будет недоступна. (выйти можно в любой момент)</i>')

healing_text = ('❕ Вы начали восстановление в лазарете!\n\n<i>'
                ' - Об каждой регенерирации бот будет отправлять сообщение (без звука), а по завершении оповестит вас уведомлением\n'
                ' -  Имейте ввиду что после тех.работ в боте вы автоматически покинете лазарет.</i>')


MOB_NAMES = ('Гоблин', 'Слизь', 'Демон', 'Гном', 'Паучек', 'Воин-Скелет',
             'Рыцарь-Скелет', 'Страж-Скелет', 'Орк', 'Скелет', 'Лучник-Скелет')
